app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      if artist = Artist.find_by(id: params[:artist_id])
        @songs = artist.songs
      else
        redirect_to artists_path
        flash[:alert] = "Artist not found."
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"

  def show
    if params[:artist_id]
      if @song = Song.find_by(id: params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]